

# **********Variáveis de configuração**********

Ttool = 30000 # tempo de mudança de ferramenta, ms
Tmain = 9999999999 # tempo de manutenção, ms

# arestas para grafo simplificado
simple_edges = [
    # nó 1, nó 2, ferramenta, tempo
    ('P1', 'P3', "T1", 45000),
    ('P4', 'P6', "T2", 25000),
    ('P2', 'P8', "T1", 45000),
    ('P3', 'P4', "T2", 15000),
    ('P3', 'P4', "T3", 25000),
    ('P4', 'P7', "T3", 15000),
    ('P4', 'P5', "T4", 25000),
    ('P8', 'P9', "T5", 45000),
    ('P8', 'P7', "T6", 15000)
]

# arestas para grafo completo
edges = [
    # peça 1, peça 2, peso(começa com valor 1), tempo, ferramenta, id_máquina

    # Transformação P1 -> P3 com T1 ocorre em todas as máquinas com tempo 45000
    ('P1', 'P3', 1, 45000, 1, 1),
    ('P1', 'P3', 1, 45000, 1, 2),
    ('P1', 'P3', 1, 45000, 1, 3),
    ('P1', 'P3', 1, 45000, 1, 4),
    ('P1', 'P3', 1, 45000, 1, 5),
    ('P1', 'P3', 1, 45000, 1, 6),
    ('P1', 'P3', 1, 45000, 1, 7),
    ('P1', 'P3', 1, 45000, 1, 8),
    ('P1', 'P3', 1, 45000, 1, 9),
    ('P1', 'P3', 1, 45000, 1, 10),
    ('P1', 'P3', 1, 45000, 1, 11),
    ('P1', 'P3', 1, 45000, 1, 12),

    # Transformação P3 -> P4 com T2 ocorre nas máquinas 1 a 6 com tempo 15000
    ('P3', 'P4', 1, 15000, 2, 1),
    ('P3', 'P4', 1, 15000, 2, 2),
    ('P3', 'P4', 1, 15000, 2, 3),
    ('P3', 'P4', 1, 15000, 2, 4),
    ('P3', 'P4', 1, 15000, 2, 5),
    ('P3', 'P4', 1, 15000, 2, 6),

    # Transformação P3 -> P4 com T3 ocorre nas máquinas 1 a 6 com tempo 25000
    ('P3', 'P4', 1, 25000, 3, 1),
    ('P3', 'P4', 1, 25000, 3, 2),
    ('P3', 'P4', 1, 25000, 3, 3),
    ('P3', 'P4', 1, 25000, 3, 4),
    ('P3', 'P4', 1, 25000, 3, 5),
    ('P3', 'P4', 1, 25000, 3, 6),

    # Transformação P4 -> P5 com T4 ocorre nas máquinas 7 a 12 com tempo 25000
    ('P4', 'P5', 1, 25000, 4, 7),
    ('P4', 'P5', 1, 25000, 4, 8),
    ('P4', 'P5', 1, 25000, 4, 9),
    ('P4', 'P5', 1, 25000, 4, 10),
    ('P4', 'P5', 1, 25000, 4, 11),
    ('P4', 'P5', 1, 25000, 4, 12),

    # Transformação P4 -> P6 com T2 ocorre nas máquinas 1 a 6 com tempo 25000
    ('P4', 'P6', 1, 25000, 2, 1),
    ('P4', 'P6', 1, 25000, 2, 2),
    ('P4', 'P6', 1, 25000, 2, 3),
    ('P4', 'P6', 1, 25000, 2, 4),
    ('P4', 'P6', 1, 25000, 2, 5),
    ('P4', 'P6', 1, 25000, 2, 6),

    # Transformação P4 -> P7 com T3 ocorre nas máquinas 1 a 6 com tempo 15000
    ('P4', 'P7', 1, 15000, 3, 1),
    ('P4', 'P7', 1, 15000, 3, 2),
    ('P4', 'P7', 1, 15000, 3, 3),
    ('P4', 'P7', 1, 15000, 3, 4),
    ('P4', 'P7', 1, 15000, 3, 5),
    ('P4', 'P7', 1, 15000, 3, 6),

    # Transformação P2 -> P8 com T1 ocorre em todas as máquinas com tempo 45000
    ('P2', 'P8', 1, 45000, 1, 1),
    ('P2', 'P8', 1, 45000, 1, 2),
    ('P2', 'P8', 1, 45000, 1, 3),
    ('P2', 'P8', 1, 45000, 1, 4),
    ('P2', 'P8', 1, 45000, 1, 5),
    ('P2', 'P8', 1, 45000, 1, 6),
    ('P2', 'P8', 1, 45000, 1, 7),
    ('P2', 'P8', 1, 45000, 1, 8),
    ('P2', 'P8', 1, 45000, 1, 9),
    ('P2', 'P8', 1, 45000, 1, 10),
    ('P2', 'P8', 1, 45000, 1, 11),
    ('P2', 'P8', 1, 45000, 1, 12),

    # Transformação de P8 -> P7 com T6 ocorre nas máquinas 8, 10 e 12 com tempo 15000
    ('P8', 'P7', 1, 15000, 6, 8),
    ('P8', 'P7', 1, 15000, 6, 10),
    ('P8', 'P7', 1, 15000, 6, 12),

    # transformação de P8 -> P9 com T5 ocorre nas máquinas 7, 9 e 11 com tempo 45000
    ('P8', 'P9', 1, 45000, 5, 7),
    ('P8', 'P9', 1, 45000, 5, 9),
    ('P8', 'P9', 1, 45000, 5, 11)
]

# *********************************************